

'use client'

import React, { useState } from 'react';
import { AgGridReact } from 'ag-grid-react';
import 'ag-grid-community/styles/ag-grid.css';
import 'ag-grid-community/styles/ag-theme-quartz.css';

const CourseTable = () => {
  // Row Data: The data to be displayed.
  const [rowData, setRowData] = useState([
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'شیمی-تست', مدرس: ' اشکان عظیمی', سطح: 2,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'شیمی-تست', مدرس: ' اشکان عظیمی', سطح: 2,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'شیمی-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'آنلاین','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'شیمی-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'شیمی-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'شیمی-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 2,نوع:'آنلاین','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'آنلاین','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 2,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 2,نوع:'آنلاین','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 2,نوع:'آنلاین','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 2,نوع:'آنلاین','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'آنلاین','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 2,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },
    { دوره: 'زیست-تست', مدرس: ' اشکان عظیمی', سطح: 1,نوع:'حضوری','تعداد جلسه':20, برگذارشده :10, وضعیت: true },

  ]);

  // Column Definitions: Defines the columns to be displayed.
  const [colDefs, setColDefs] = useState([
    { headerName: 'ردیف', valueGetter: 'node.rowIndex + 1', width: 100 },
    { field: 'دوره' },
    { field: 'مدرس' },
    { field: 'سطح' },
    { field: 'نوع' },
    { field: 'وضعیت' },
    { field: 'تعداد جلسه' },
    { field: 'برگذارشده' },


    {
      headerName: 'عملیات',
      cellRenderer: 'buttonRenderer',
      cellRendererParams: {
        onClick: (row) => {
          // Handle button click for the specific row
          console.log('Button Clicked for Row:', row.data);
        },
      },
    },
  ]);

  const frameworkComponents = {
    buttonRenderer: ButtonRenderer,
  };

  return (
    <div className="ag-theme-quartz w-full px-[15%] md:px-4" style={{ height: 700, fontFamily: 'IRANSansWeb' }}>
      <AgGridReact rowData={rowData} columnDefs={colDefs} enableRtl={true} frameworkComponents={frameworkComponents} />
    </div>
  );
};

// Custom Button Renderer Component
const ButtonRenderer = (props) => {
  const handleClick = () => {
    props.onClick(props.node);
  };

  return <button className='text-black' onClick={handleClick}>Click Me</button>;
};

export default CourseTable;

